/*$Id: sapgorsw.c,v 1.6 2011-02-21 07:35:57 sasa Exp $*/
/*16.11.2009	10.08.2006	Белых А.И.	sapgorsw.c
Распечатка шапки журнал-ордера с развёрнутым сальдо
*/
#include <stdio.h>
#include <libintl.h>



void sapgorsw(short dn,short mn,short gn,
short dk,short mk,short gk,int *nom_lista,int *kolstrok,FILE *ff)
{
*nom_lista+=1;
*kolstrok+=6;

fprintf(ff,"%100s%s N%d\n","",gettext("Лист"),*nom_lista);
fprintf(ff,"\
--------------------------------------------------------------------------------------------------------------------------\n");

fprintf(ff,gettext("  Код     |    Наименование    | C а л ь д о  на  %02d.%02d.%d |    Оборот за период         | С а л ь д о  на  %02d.%02d.%d |\n"),
dn,mn,gn,dk,mk,gk);
fprintf(ff,gettext("контраген-|     контрагента    -------------------------------------------------------------------------------------------\n"));
fprintf(ff,gettext("   та     |                    |   Дебет      |   Кредит     |   Дебет      |    Кредит    |   Дебет      |   Кредит     |\n"));

fprintf(ff,"\
--------------------------------------------------------------------------------------------------------------------------\n");


}
