/*$Id: in_d12_startw.c,v 1.5 2011-01-13 13:49:50 sasa Exp $*/
/*26.04.2010	23.10.2007	Белых А.И.	in_d12_startw.c
Вывод шапки документа
Возвращает количество строк выведенных в файл
*/
#include <unistd.h>
#include "buhg_g.h"

int in_d12_startw(FILE *ff)
{
int kolstr=0;
kolstr=iceb_insfil("in_d12_start.alx",ff,NULL);
fprintf(ff,"\
----------------------------------------------------------------------------------------------------------------------\n\
N за |      Найменування            |Значиться в інвентаризаці-| Фактична наявність       |     Результат:           |\n\
опи- |       цінностей              |йному описі               |                          |(+)лишки, (-)недостачі    |\n\
сом  |                              |--------------------------------------------------------------------------------|\n\
     |                              | Кількість|Ціна|  Сума    | Кількість|Ціна|  Сума    | Кількість|Ціна|  Сума    |\n\
----------------------------------------------------------------------------------------------------------------------\n");

kolstr+=6;

return(kolstr);


}

