/*$Id: koncinvw.c,v 1.7 2011-02-21 07:35:52 sasa Exp $*/
/*12.10.2010	10.08.2003	Белых А.И. 	koncinvw.c
Концовка инвентаризационной ведемоти
*/
#include	<stdio.h>
#include "buhg_g.h"


void koncinvw(char *mesqc,short gos,FILE *ff2)
{
iceb_insfil("inved_end.alx",ff2,NULL);

/*************************
fprintf(ff2,"\n\
%*s:_________________________________________________\n\n\
____________________________________________________________________________________\n\n\
%*s:_________________________________________________\n\n\
____________________________________________________________________________________\n",
iceb_u_kolbait(25,gettext("Общее количество единиц фактически")),gettext("Общее количество единиц фактически"),
iceb_u_kolbait(25,gettext("Всего фактически по ведомости грн.")),gettext("Всего фактически по ведомости грн."));

fprintf(ff2,"\n\
%*s _____________________________________________\n\n\
%*s:_____________________________________________\n\n\
%25s _____________________________________________\n\n\
%25s _____________________________________________\n\n\
%25s _____________________________________________\n\n\
%25s _____________________________________________\n\n\
%25s _____________________________________________\n\n",
iceb_u_kolbait(25,gettext("Председатель комиссии")),gettext("Председатель комиссии"),
iceb_u_kolbait(25,gettext("Члены комиссии")),gettext("Члены комиссии"),
" "," "," "," "," ");

fprintf(ff2,gettext("\
 Все ценности, поименованные в настоящей инвентаризационной описи с N_________ по\n\
N________  комиссией проверены в натуре в моём (нашем) присутствии и внесены в опись,\n\
в связи с чем претензий к инвентаризационной комиссии не имею (не имеем). Ценности,\n\
перечисленные в описи, находятся на моём (нашем) ответственном хранении.\n\n"));

fprintf(ff2,"\n\
%s __________________________________\n\n\
\"______\" %s %d%s\n",
gettext("Материально-ответственное лицо (лица)"),
mesqc,gos,
gettext("г."));

fprintf(ff2,"\
%s:\n\n\
%20s%s_______________________\n",
gettext("Указанные в этой описи данные та расчеты проверил"),
" ",gettext("бухгалтер"));

fprintf(ff2,"\"_____\" %s %d%s\n",
mesqc,gos,gettext("г."));
*****************************/
}
