/* $Id: sapkkivw.c,v 1.6 2011-02-21 07:35:57 sasa Exp $ */
/*20.07.2003    01.02.1994      Белых А.И.      sapkkivw.c
Шапка инвентразации и приема - передачи материалов
*/
#include	"buhg_g.h"


void		sapkkivw(int *kolstr,int kollist,FILE *ff2)
{

*kolstr+=5;

fprintf(ff2,"%100s %s N%d\n\
---------------------------------------------------------------------------------------------------------------------------------\n",
" ",gettext("Лист"),kollist);
fprintf(ff2,gettext("\
 N |            Наименование                |Едини.|  Цена    |Наличие по бух.учету | Фактическое наличие |     Разница         |\n"));
fprintf(ff2,gettext("\
   |                                        |измер.|          |Количество|  Сумма   |Количество|  Сумма   |Количество|  Сумма   |\n"));
fprintf(ff2,"\
---------------------------------------------------------------------------------------------------------------------------------\n");
 
}
