/*$Id: sspp1w.c,v 1.11 2011-02-21 07:35:57 sasa Exp $*/
/*30.09.2009	18.02.2003	Белых А.И.	sspp1w.c
Шапка платежной ведомости
*/
#include        <math.h>
#include        "buhg_g.h"

void sspp1w(FILE *kaw1,int list,int *kolstr)
{

if(list > 1)
  fprintf(kaw1,"\f");

fprintf(kaw1,"%35s %s N%d\n"," ",gettext("Вставной лист к дополнению"),list);

fprintf(kaw1,"\
------------------------------------------------------------------------------\n");
fprintf(kaw1,gettext("\
 N | Таб. N|  Фамилия, имя, отчество          |  Сумма   |Подпись о |Примеча-|\n\
   |       |                                  |          |получении | ния    |\n"));
fprintf(kaw1,"\
------------------------------------------------------------------------------\n");
*kolstr+=5;
}
